results/task#4/wrk_get.txt
 wrk  -t4 -c200 -d30s -sget.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 3.370ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.009ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 1.915ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.824ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.82ms    2.07ms  20.69ms   79.23%
    Req/Sec   525.41    783.01     4.55k    93.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.25ms
 75.000%    3.79ms
 90.000%    5.37ms
 99.000%   10.28ms
 99.900%   16.15ms
 99.990%   19.49ms
 99.999%   20.70ms
100.000%   20.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.115     0.000000            1         1.00
       0.853     0.100000         3947         1.11
       1.196     0.200000         7893         1.25
       1.501     0.300000        11836         1.43
       1.835     0.400000        15787         1.67
       2.249     0.500000        19725         2.00
       2.507     0.550000        21696         2.22
       2.803     0.600000        23663         2.50
       3.109     0.650000        25650         2.86
       3.433     0.700000        27612         3.33
       3.789     0.750000        29590         4.00
       3.979     0.775000        30572         4.44
       4.195     0.800000        31559         5.00
       4.423     0.825000        32540         5.71
       4.687     0.850000        33525         6.67
       4.979     0.875000        34516         8.00
       5.163     0.887500        35009         8.89
       5.367     0.900000        35507        10.00
       5.571     0.912500        35989        11.43
       5.831     0.925000        36488        13.33
       6.151     0.937500        36974        16.00
       6.359     0.943750        37221        17.78
       6.603     0.950000        37467        20.00
       6.867     0.956250        37713        22.86
       7.219     0.962500        37963        26.67
       7.623     0.968750        38206        32.00
       7.883     0.971875        38329        35.56
       8.087     0.975000        38453        40.00
       8.383     0.978125        38577        45.71
       8.735     0.981250        38700        53.33
       9.151     0.984375        38824        64.00
       9.399     0.985938        38884        71.11
       9.759     0.987500        38947        80.00
      10.079     0.989062        39009        91.43
      10.455     0.990625        39069       106.67
      10.815     0.992188        39130       128.00
      11.111     0.992969        39161       142.22
      11.431     0.993750        39192       160.00
      11.847     0.994531        39223       182.86
      12.143     0.995313        39254       213.33
      12.575     0.996094        39284       256.00
      12.815     0.996484        39302       284.44
      12.951     0.996875        39316       320.00
      13.231     0.997266        39331       365.71
      13.575     0.997656        39346       426.67
      14.119     0.998047        39361       512.00
      14.487     0.998242        39369       568.89
      14.895     0.998437        39377       640.00
      15.167     0.998633        39385       731.43
      15.447     0.998828        39392       853.33
      16.255     0.999023        39400      1024.00
      16.687     0.999121        39404      1137.78
      16.975     0.999219        39408      1280.00
      17.055     0.999316        39412      1462.86
      17.183     0.999414        39415      1706.67
      17.919     0.999512        39419      2048.00
      18.047     0.999561        39421      2275.56
      18.143     0.999609        39423      2560.00
      18.207     0.999658        39425      2925.71
      18.271     0.999707        39428      3413.33
      18.351     0.999756        39429      4096.00
      18.431     0.999780        39431      4551.11
      18.431     0.999805        39431      5120.00
      18.447     0.999829        39432      5851.43
      19.087     0.999854        39433      6826.67
      19.487     0.999878        39434      8192.00
      19.487     0.999890        39434      9102.22
      19.919     0.999902        39435     10240.00
      19.919     0.999915        39435     11702.86
      20.559     0.999927        39436     13653.33
      20.559     0.999939        39436     16384.00
      20.559     0.999945        39436     18204.44
      20.607     0.999951        39437     20480.00
      20.607     0.999957        39437     23405.71
      20.607     0.999963        39437     27306.67
      20.607     0.999969        39437     32768.00
      20.607     0.999973        39437     36408.89
      20.703     0.999976        39438     40960.00
      20.703     1.000000        39438          inf
#[Mean    =        2.819, StdDeviation   =        2.069]
#[Max     =       20.688, Total count    =        39438]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58925 requests in 30.00s, 5.56MB read
  Non-2xx or 3xx responses: 58925
Requests/sec:   1964.05
Transfer/sec:    189.88KB