results/task#4/wrk_put.txt
 wrk  -t4 -c200 -d30s -sput.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 2.151ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.837ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.803ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 2.134ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.02ms    2.22ms  35.74ms   75.27%
    Req/Sec   525.72    731.26     3.57k    93.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.37ms
 75.000%    4.33ms
 90.000%    5.89ms
 99.000%    9.81ms
 99.900%   18.22ms
 99.990%   30.40ms
 99.999%   35.78ms
100.000%   35.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.109     0.000000            1         1.00
       0.843     0.100000         3951         1.11
       1.212     0.200000         7896         1.25
       1.551     0.300000        11839         1.43
       1.905     0.400000        15777         1.67
       2.369     0.500000        19733         2.00
       2.679     0.550000        21709         2.22
       3.031     0.600000        23667         2.50
       3.431     0.650000        25638         2.86
       3.867     0.700000        27614         3.33
       4.331     0.750000        29591         4.00
       4.575     0.775000        30566         4.44
       4.823     0.800000        31569         5.00
       5.075     0.825000        32538         5.71
       5.311     0.850000        33532         6.67
       5.587     0.875000        34510         8.00
       5.731     0.887500        35019         8.89
       5.895     0.900000        35501        10.00
       6.071     0.912500        35989        11.43
       6.275     0.925000        36482        13.33
       6.515     0.937500        36977        16.00
       6.683     0.943750        37222        17.78
       6.847     0.950000        37475        20.00
       7.039     0.956250        37715        22.86
       7.271     0.962500        37961        26.67
       7.587     0.968750        38207        32.00
       7.763     0.971875        38330        35.56
       7.971     0.975000        38454        40.00
       8.279     0.978125        38579        45.71
       8.583     0.981250        38703        53.33
       8.967     0.984375        38824        64.00
       9.183     0.985938        38885        71.11
       9.415     0.987500        38948        80.00
       9.631     0.989062        39008        91.43
       9.959     0.990625        39070       106.67
      10.343     0.992188        39131       128.00
      10.615     0.992969        39162       142.22
      10.879     0.993750        39195       160.00
      11.215     0.994531        39224       182.86
      11.599     0.995313        39255       213.33
      11.935     0.996094        39286       256.00
      12.223     0.996484        39301       284.44
      12.535     0.996875        39316       320.00
      12.863     0.997266        39332       365.71
      13.551     0.997656        39347       426.67
      14.575     0.998047        39362       512.00
      15.111     0.998242        39370       568.89
      15.719     0.998437        39378       640.00
      16.671     0.998633        39386       731.43
      17.327     0.998828        39393       853.33
      18.431     0.999023        39401      1024.00
      18.751     0.999121        39405      1137.78
      19.071     0.999219        39409      1280.00
      19.887     0.999316        39413      1462.86
      20.111     0.999414        39416      1706.67
      20.495     0.999512        39420      2048.00
      20.735     0.999561        39422      2275.56
      20.799     0.999609        39424      2560.00
      21.391     0.999658        39426      2925.71
      25.183     0.999707        39428      3413.33
      27.535     0.999756        39430      4096.00
      28.543     0.999780        39431      4551.11
      28.815     0.999805        39432      5120.00
      30.111     0.999829        39433      5851.43
      30.351     0.999854        39434      6826.67
      30.399     0.999878        39435      8192.00
      30.399     0.999890        39435      9102.22
      31.423     0.999902        39436     10240.00
      31.423     0.999915        39436     11702.86
      31.775     0.999927        39437     13653.33
      31.775     0.999939        39437     16384.00
      31.775     0.999945        39437     18204.44
      32.079     0.999951        39438     20480.00
      32.079     0.999957        39438     23405.71
      32.079     0.999963        39438     27306.67
      32.079     0.999969        39438     32768.00
      32.079     0.999973        39438     36408.89
      35.775     0.999976        39439     40960.00
      35.775     1.000000        39439          inf
#[Mean    =        3.024, StdDeviation   =        2.217]
#[Max     =       35.744, Total count    =        39439]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58926 requests in 30.00s, 4.66MB read
Requests/sec:   1964.02
Transfer/sec:    159.19KB